tutorials/incompressible/channelFoam/channel395/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (4 0 0)
    (0 1 0)
    (4 1 0)
    (0 2 0)
    (4 2 0)
    (0 0 2)
    (4 0 2)
    (0 1 2)
    (4 1 2)
    (0 2 2)
    (4 2 2)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) (40 25 30) simpleGrading (1 10.7028 1)
    hex (2 3 5 4 8 9 11 10) (40 25 30) simpleGrading (1 0.0984 1)
);

edges
(
);

boundary
(
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 7 6)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (4 10 11 5)
        );
    }

    sides1
    {
        type cyclic;
        faces
        (
            (0 2 3 1)
            (6 7 9 8)
        );
    }

    sides2
    {
        type cyclic;
        faces
        (
            (2 4 5 3)
            (8 9 11 10)
        );
    }

    inout1
    {
        type cyclic;
        faces
        (
            (1 3 9 7)
            (0 6 8 2)
        );
    }

    inout2
    {
        type cyclic;
        faces
        (
            (3 5 11 9)
            (2 8 10 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
